update to mermaid diagrams to display github
